Revit 2027 API
DirectContext3DHandleSettings.GetTransparency Method
 Gets the transparency value of the handle and the associated DirectContext3D graphics.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetTransparency()
Public Function GetTransparency As Integer
public:
int GetTransparency()
member GetTransparency : unit -> int
Return Value
Int32
 The transparency value (in percentage)
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace